{
  "1": {
    "ideal_activities": "Definitely heat pack, easy meal, not too much to eat as I might feel nauseous. Historically I usually order food. The first 3 hours of pain I'm usually out of action and need a hot water bottle and rocking on the floor. Shower a lot. Take it easy."
  },
  "2": {
    "ideal_activities": "Usually feel more productive. No swimming or exercise. Shower is critical. Take it easy."
  },
  "3": {
    "ideal_activities": "Avoid intense activity. No swimming or workouts. Shower helps a lot. Take it easy."
  },
  "4": {
    "ideal_activities": "Gentle routine. Shower is still helpful. Don’t push yourself. Take it easy."
  },
  "5": {
    "ideal_activities": "Start easing back into routine if possible. Keep things low effort."
  },
  "6": {
    "ideal_activities": "Still in recovery. Stick to low-key tasks and rest when you can."
  },
  "7": {
    "ideal_activities": "Low-stress activities. No pressure. Maybe light organising or tidying."
  },
  "8": {
    "ideal_activities": "Energy might dip. Don't overbook. Schedule breaks and keep it light."
  },
  "9": {
    "ideal_activities": "Plan downtime in the evening. Social morning ok, but give space for mood changes."
  },
  "10": {
    "ideal_activities": "Plan an evening meal or food in the afternoon. Don’t leave meals too late."
  },
  "11": {
    "ideal_activities": "Morning coffees or outings. Good day for light errands or social catchups."
  },
  "12": {
    "ideal_activities": "Outings and fun. Plan things that feel exciting but not too tiring."
  },
  "13": {
    "ideal_activities": "Good day for fun plans or social time. Don’t overbook though."
  },
  "14": {
    "ideal_activities": "Stay active with friends or go somewhere upbeat. Make time for play or beauty stuff."
  },
  "15": {
    "ideal_activities": "Fun day. Do something playful or romantic if it feels right. Be out and about."
  },
  "16": {
    "ideal_activities": "Calm activities. Journal, stretch, gentle walks, or reorganise something small."
  },
  "17": {
    "ideal_activities": "Gentle calm. Quiet outing or mood-boosting task. Good for short solo things."
  },
  "18": {
    "ideal_activities": "Stay inside if low energy. Consider skincare or relaxing media. No big pressure."
  },
  "19": {
    "ideal_activities": "Stay inside. Let yourself feel things. Watch something comforting."
  },
  "20": {
    "ideal_activities": "Cosy day indoors. Rest is key. Maybe tidy a little if you want to."
  },
  "21": {
    "ideal_activities": "Stay in. Slow paced. Don’t overanalyse. Let yourself feel dull."
  },
  "22": {
    "ideal_activities": "Very slow day. Take breaks. Journal or nap. Don’t plan much."
  },
  "23": {
    "ideal_activities": "Good day to reset. Prep a healthy meal or go for a short walk if you're up to it."
  },
  "24": {
    "ideal_activities": "Focus on comfort. No mirrors. Gentle media only. Don’t expect motivation."
  },
  "25": {
    "ideal_activities": "Similar to yesterday — take the pressure off. No social media if you’re feeling meh."
  },
  "26": {
    "ideal_activities": "Extremely low mood likely. Treat yourself like you would a sick cat."
  },
  "27": {
    "ideal_activities": "Low stimulation day. Distract yourself with videos or small chores. Avoid decisions."
  },
  "28": {
    "ideal_activities": "Low energy and boredom likely. Try a cosy routine. Avoid people who annoy you."
  }
}
